// 1-1. moneyArray ---------------------------------------------------------------------------->
export const moneyArray = [
  // 0
  {
    money_part: "전체",
    money_title: [
      "전체"
    ]
  },
  {
    money_part: "수입",
    money_title: [
      "전체", "근로", "금융", "기타",
    ]
  },
  {
    money_part: "지출",
    money_title: [
      "전체", "식비", "문화", "주거", "건강", "교통", "유흥", "품위", "저축", "금융", "기타",
    ]
  }
];

// 1-2. moneyPartArray ---------------------------------------------------------------------------->
export const moneyPartArray = [
  // 0
  {
    money_part: "전체",
  },
  // 1
  {
    money_part: "수입",
  },
  // 2
  {
    money_part: "지출",
  }
];

// 2-2. moneyTitleArray --------------------------------------------------------------------------->
export const moneyTitleArray = [
  // 0
  {
    money_title: [
      "전체"
    ]
  },
  // 1
  {
    money_title: [
      "전체", "근로", "금융", "기타",
    ]
  },
  // 2
  {
    money_title : [
      "전체", "식비", "문화", "주거", "건강", "교통", "유흥", "품위", "저축", "금융", "기타",
    ]
  }
];