// 0. planTotalArray ----------------------------------------------------------------------------->
export const planTotalArray = [
  // 0
  {plan_part: [
    "전체"
  ],
  plan_title: [
    "전체"
  ]},
  // 1
  {plan_part: [
    "음식"
  ],
  plan_title: [
    "전체", "칼로리", "탄수화물", "단백질", "지방"
  ]},
  // 2
  {plan_part: [
    "운동"
  ],
  plan_title: [
    "전체", "부위", "기타"
  ]},
  // 3
  {plan_part: [
    "잠"
  ],
  plan_title: [
    "전체", "취침시간", "기상시간", "수면시간"
  ]},
  // 4
  {plan_part: [
    "돈"
  ],
  plan_title: [
    "전체", "수입", "지출"
  ]},
];

// 1-1. planPartAll ------------------------------------------------------------------------------>
export const planPartAll = [
  "전체", "음식", "운동", "잠", "돈"
];

// 1-2. planPartArray ---------------------------------------------------------------------------->
export const planPartArray = [
  // 0
  {plan_part: ["전체"]},
  // 1
  {plan_part: ["음식"]},
  // 2
  {plan_part: ["운동"]},
  // 3
  {plan_part: ["잠"]},
  // 4
  {plan_part: ["돈"]},
];

// 2-1. planTitleAll ----------------------------------------------------------------------------->
export const planTitleAll = [
  // 0
  {plan_title: [
    "칼로리", "탄수화물", "단백질", "지방", "부위", "취침시간", "기상시간", "수면시간", "수입", "지출"
  ]},
  // 1
  {plan_title: [
    "칼로리", "탄수화물", "단백질", "지방"
  ]},
  // 2
  {plan_title: [
    "부위", "기타"
  ]},
  // 3
  {plan_title: [
    "취침시간", "기상시간", "수면시간"
  ]},
  // 4
  {plan_title: [
    "수입", "지출"
  ]},
];

// 2-2. planTitleArray --------------------------------------------------------------------------->
export const planTitleArray = [
  // 0
  {plan_title: [
    "전체"
  ]},
  // 1
  {plan_title: [
    "전체", "칼로리", "탄수화물", "단백질", "지방"
  ]},
  // 2
  {plan_title: [
    "전체", "부위", "기타"
  ]},
  // 3
  {plan_title: [
    "전체", "취침시간", "기상시간", "수면시간"
  ]},
  // 4
  {plan_title: [
    "전체", "수입", "지출"
  ]},
];